#! /usr/bin/env python3
# -*- coding: utf-8 -*-

# =====================================================================
# Copyright (C) 2018-2019 by Owl Data
# author: Danny, Destiny

# =====================================================================

# 各種欄位表
colist_dict = {
    'ssp':['日期', '股票名稱', '開盤價', '最高價', 
           '最低價', '收盤價', '漲跌', '漲幅(%)', 
           '成交量', '成交筆數', '成交金額(千)', '均張', 
           '均價', '成交量(股)'],
    
    'msp':['股票代號', '股票名稱', '日期', '開盤價',
            '最高價', '最低價', '收盤價', '漲跌', '漲幅(%)', 
            '成交量', '成交筆數', '成交金額(千)', '均張', 
            '均價', '成交量(股)'],
    
    'fis':['年度', '流動資產', '非流動資產', '資產總計', '流動負債', 
           '非流動負債', '負債總計', '權益總計', '公告每股淨值', 
           '營業收入(千)', '營業成本(千)', '營業毛利(千)', '營業費用(千)', 
           '營業利益(千)', '營業外收入及支出(千)', '稅前純益(千)', '所得稅(千)', 
           '稅後純益歸屬(千)', '每股盈餘(元)', '營業活動現金流量(千)', 
           '投資活動現金流量(千)', '籌資活動現金流量(千)', 
           '本期現金及約當現金增減數(千)', '期末現金及約當現金餘額(千)', 
           '自由現金流量(千)'],
    
    'fim':['股票代號', '股票名稱', '年度', '流動資產', '非流動資產', '資產總計', 
           '流動負債', '非流動負債', '負債總計', '權益總計', '公告每股淨值', 
           '營業收入(千)', '營業成本(千)', '營業毛利(千)', '營業費用(千)', 
           '營業利益(千)', '營業外收入及支出(千)', '稅前純益(千)', '所得稅(千)', 
           '稅後純益歸屬(千)', '每股盈餘(元)', '營業活動現金流量(千)', 
           '投資活動現金流量(千)', '籌資活動現金流量(千)', 
           '本期現金及約當現金增減數(千)', '期末現金及約當現金餘額(千)', 
           '自由現金流量(千)'],
    
    'chs':['日期', '法人買賣超', '法人買賣超金額(千)', '外資買賣超', 
           '外資買賣超金額(千)', '投信買賣超', '投信買賣超金額(千)', 
           '自營買賣超', '自營買賣超金額(千)', '融資增減', '融資餘額', 
           '融資使用率', '融券增減', '融券餘額', '融券使用率', '券資比', '當沖比率'],
    'chm':[],
    'tis':[],
    'tim':[],
    'cim':[],
    'dps':[],
    'dpm':[],
    'edps':[],
    'edpm':[],
    'tsp':[]
}
