#! /usr/bin/env python3
# -*- coding: utf-8 -*-

# =====================================================================
# Copyright (C) 2018-2019 by Owl Data
# author: Danny, Destiny

# =====================================================================

# 各種欄位表
colist_dict = {
    'ssp':['日期', '股票名稱', '開盤價', '最高價', 
           '最低價', '收盤價', '漲跌', '漲幅(%)', 
           '成交量', '成交筆數', '成交金額(千)', '均張', 
           '均價', '成交量(股)'],
    'msp':[],
    'fis':[],
    'fim':[],
    'chs':[],
    'chm':[],
    'tis':[],
    'tim':[],
    'cim':[],
    'dps':[],
    'dpm':[],
    'edps':[],
    'edpm':[],
    'tsp':[]
}
